package com.mn.socketp1.domain.dto.protocol.infocontent.kn;

import lombok.Getter;

/**
 * AUTHOR MisakaNetwork
 * DATE 2020/3/26 14:27
 * DESC 部件类型  协议8.2.1.2
 */
@Getter
public enum ComponentType {
    CT_01("通用", "00"),
    CT_02("火灾报警控制器", "01"),
    CT_03("预留1", "02-09"),
    CT_04("可燃气体探测器", "0a"),
    CT_05("点型可燃气体探测器", "0b"),
    CT_06("独立式可燃气体探测器", "0c"),
    CT_07("线型可燃气体探测器", "0d"),
    CT_08("预留2", "0e-0f"),
    CT_09("电气火灾监控报警器", "10"),
    CT_10("剩余电流式电气火灾监控探测器", "11"),
    CT_11("测温式电气火灾监控探测器", "12"),
    CT_12("预留3", "13-14"),
    CT_13("探测回路", "15"),
    CT_14("火灾显示盘", "16"),
    CT_15("手动火灾报警按钮", "17"),
    CT_16("消火栓按钮", "18"),
    CT_17("火灾探测器", "19"),
    CT_18("预留4", "1a-1d"),
    CT_19("感温火灾探测器", "1e"),
    CT_20("点型感温火灾探测器", "1f"),
    CT_21("点型感温火灾探测器(S型)", "20"),
    CT_22("点型感温火灾探测器(R型)", "21"),
    CT_23("线型感温火灾探测器", "22"),
    CT_24("线型感温火灾探测器(S型)", "23"),
    CT_25("线型感温火灾探测器(R型)", "24"),
    CT_26("光纤感温火灾探测器", "25"),
    CT_27("预留5", "26"),
    CT_28("预留6", "27"),
    CT_29("感烟火灾探测器", "28"),
    CT_30("点型离子感烟火灾探测器", "29"),
    CT_31("点型光电感烟火灾探测器", "2a"),
    CT_32("线型光束感烟火灾探测器", "2b"),
    CT_33("吸气式感烟火灾探测器", "2c"),
    CT_34("预留7", "2d-31"),
    CT_35("复合式火灾探测器", "32"),
    CT_36("复合式感烟感温火灾探测器", "33"),
    CT_37("复合式感光感温火灾探测器", "34"),
    CT_38("复合式感光感烟火灾探测器", "35"),
    CT_39("预留8", "36-3b"),
    CT_40("预留9", "3c"),
    CT_41("紫外火焰探测器", "3d"),
    CT_42("红外火焰探测器", "3e"),
    CT_43("预留10", "3f-44"),
    CT_44("感光火灾探测器", "45"),
    CT_45("预留11", "46-49"),
    CT_46("气体探测器", "4a"),
    CT_47("预留12", "4b-4d"),
    CT_48("图像摄像方式火灾探测器", "4e"),
    CT_49("感声火灾探测器", "4f"),
    CT_50("预留13", "50"),
    CT_51("气体灭火控制器", "51"),
    CT_52("消防电气控制装置", "52"),
    CT_53("消防控制室图形显示装置", "53"),
    CT_54("模块", "54"),
    CT_55("输入模块", "55"),
    CT_56("输出模块", "56"),
    CT_57("输入/输出模块", "57"),
    CT_58("中继模块", "58"),
    CT_59("预留14", "59-5a"),
    CT_60("消防水泵", "5b"),
    CT_61("消防水箱", "5c"),
    CT_62("预留15", "5d-5e"),
    CT_63("喷淋泵", "5f"),
    CT_64("水流指示器", "60"),
    CT_65("信号阀", "61"),
    CT_66("报警阀", "62"),
    CT_67("压力开关", "63"),
    CT_68("预留16", "64"),
    CT_69("阀驱动装置", "65"),
    CT_70("防火门", "66"),
    CT_71("防火阀", "67"),
    CT_72("通风空调", "68"),
    CT_73("泡沫液泵", "69"),
    CT_74("管网电磁阀", "6a"),
    CT_75("预留17", "6b-6e"),
    CT_76("防烟排烟风机", "6f"),
    CT_77("预留18", "70"),
    CT_78("排烟防火阀", "71"),
    CT_79("常闭送风口", "72"),
    CT_80("排烟口", "73"),
    CT_81("电控挡烟垂壁", "74"),
    CT_82("防火卷帘控制器", "75"),
    CT_83("防火门监控器", "76"),
    CT_84("预留19", "77-78"),
    CT_85("警报装置", "79"),
    CT_86("预留20", "7a-7f"),
    CT_87("用户自定义", "80-ff");

    private String meaning;  //含义
    private String hex;  //协议中16进制的表示

    ComponentType(String meaning, String hex) {
        this.meaning = meaning;
        this.hex = hex;  //协议中16进制的表示
    }

    public static String getMeaning(String hex) {
        for (ComponentType componentType : ComponentType.values()) {
            if (componentType.getHex().equals(hex)) {
                return componentType.getMeaning();
            }
        }
        return "hex指示的数据不存在";
    }
}
